SpenceKonde/DxCore/megaavr/variants/20pin-ddseries/pins_arduino.h
/* Use this for accessing PINnCTRL register */
const uint8_t digital_pin_to_bit_position[] = { // *INDENT-OFF*
  #if CLOCK_SOURCE == 0 // PA0 used for external clock and crystal.
    PIN0_bp,//   0 PA0
  #else
    NOT_A_PIN,
  #endif
  #if CLOCK_SOURCE == 1   // PA1 also used for crystal
    NOT_A_PIN,
  #else // PA1 used for external crystal.
    PIN1_bp,//   1 PA1
  #endif    // *INDENT-ON*
  PIN2_bp,   //  2 PA2/SDA
  PIN3_bp,   //  3 PA3/SCL
  PIN4_bp,   //  4 PA4/MOSI
  PIN5_bp,   //  5 PA5/MISO
  PIN6_bp,   //  6 PA6/SCK
  PIN7_bp,   //  7 PA7/SS/CLKOUT
  NOT_A_PIN, //  8 VDDIO2
  PIN1_bp,   //  9 PC1/USART1_Rx
  PIN2_bp,   // 10 PC2
  PIN3_bp,   // 11 PC3
  NOT_A_PIN, // 12 VDDIO2
  NOT_A_PIN, // 13 PD1/AIN1
  NOT_A_PIN, // 14 PD2/AIN2
  NOT_A_PIN, // 15 PD3/AIN3/LED_BUILTIN
  PIN4_bp,   // 16 PD4/AIN4
  PIN5_bp,   // 17 PD5/AIN5
  PIN6_bp,   // 18 PD6/AIN6
  PIN7_bp,   // 19 PD7/AIN7/AREF
  PIN6_bp,   // 26 PF6 RESET
  PIN7_bp    // 27 PF7 UPDI
};

const uint8_t digital_pin_to_bit_mask[] = { // *INDENT-OFF*
  #if CLOCK_SOURCE == 0 // PA0 used for external clock and crystal.
    PIN0_bm,//   0 PA0
  #else
    NOT_A_PIN,
  #endif
  #if CLOCK_SOURCE == 1   // PA1 also used for crystal
    NOT_A_PIN,
  #else // PA1 used for external crystal.
    PIN1_bm,//   1 PA1
  #endif    // *INDENT-ON*
  PIN2_bm,   //  2 PA2/SDA
  PIN3_bm,   //  3 PA3/SCL
  PIN4_bm,   //  4 PA4/MOSI
  PIN5_bm,   //  5 PA5/MISO
  PIN6_bm,   //  6 PA6/SCK
  PIN7_bm,   //  7 PA7/SS/CLKOUT
  NOT_A_PIN, //  8 PC0 NOT_A_PIN
  PIN1_bm,   //  9 PC1/USART1_Rx
  PIN2_bm,   // 10 PC2
  PIN3_bm,   // 11 PC3
  NOT_A_PIN, // 12 PD0 NOT_A_PIN VDDIO2
  NOT_A_PIN, // 13 PD0 NOT_A_PIN
  NOT_A_PIN, // 14 PD0 NOT_A_PIN
  NOT_A_PIN, // 15 PD0 NOT_A_PIN
  PIN4_bm,   // 16 PD4/AIN4
  PIN5_bm,   // 17 PD5/AIN5
  PIN6_bm,   // 18 PD6/AIN6
  PIN7_bm,   // 19 PD7/AIN7/AREF
  PIN6_bm,   // 26 PF6 RESET
  PIN7_bm    // 27 PF7 UPDI
};

const uint8_t digital_pin_to_timer[] = {
  NOT_ON_TIMER, //  0 PA0/USART0_Tx/CLKIN    default TCA0 WO0
  NOT_ON_TIMER, //  1 PA1/USART0_Rx          default TCA0 WO1
  TIMERB0,      //  2 PA2/SDA                default TCA0 WO2
  TIMERB1,      //  3 PA3/SCL                default TCA0 WO3
  TIMERD0_0WOA, //  4 PA4/MOSI      WOA      default TCA0 WO4
  TIMERD0_0WOB, //  5 PA5/MISO      WOB      default TCA0 WO5
  TIMERD0_0WOC, //  6 PA6/SCK       WOC mirrors WOA
  TIMERD0_0WOD, //  7 PA7/SS/CLKOUT WOD mirrors WOB
  NOT_ON_TIMER, //  8 PC0 NOT_A_PIN
  NOT_ON_TIMER, //  9 PC1/USART1_Rx
  NOT_ON_TIMER, // 10 PC2
  NOT_ON_TIMER, // 11 PC3
  NOT_ON_TIMER, // 12 PD0 NOT_A_PIN VDDIO2
  NOT_ON_TIMER, // 13 PD1 NOT_A_PIN
  NOT_ON_TIMER, // 14 PD2 NOT_A_PIN
  NOT_ON_TIMER, // 15 PD3 NOT_A_PIN
  TIMERD0_4WOC, // 16 PD4/AIN4
  TIMERD0_4WOD, // 17 PD5/AIN5
  DACOUT,       // 18 PD6/AIN6
  NOT_ON_TIMER, // 19 PD7/AIN7/AREF
  NOT_ON_TIMER, // 26 PF6 RESET
  NOT_ON_TIMER, // 27 PF7 UPDI
};

#endif

#endif
